espressif/arduino-esp32/libraries/ESP_Video/src/ESP_Video.cpp
/*
* SPDX-FileCopyrightText: 2026 Espressif Systems (Shanghai) CO LTD
*
* SPDX-License-Identifier: ESPRESSIF MIT
*/

#include "sdkconfig.h"
#if (CONFIG_ESP_VIDEO_ENABLE_MIPI_CSI_VIDEO_DEVICE || CONFIG_ESP_VIDEO_ENABLE_DVP_VIDEO_DEVICE)
#include "esp_idf_version.h"
#if ESP_IDF_VERSION >= ESP_IDF_VERSION_VAL(5, 4, 0)
#include "ESP_Video.h"
#include "esp32-hal-periman.h"

#include <fcntl.h>
#include <sys/ioctl.h>
#include <sys/mman.h>
#include <cstring>

#include "esp_video_ioctl.h"

const uint32_t ESPVideoCamConfigClass::i2c_freq_hz = 100 * 1000;

static bool video_format_to_v4l2_format(esp_video_format_t format, uint32_t &v4l2_format, std::string &format_name) {
  switch (format) {
    case ESP_VIDEO_FORMAT_RAW8:
      v4l2_format = V4L2_PIX_FMT_SRGGB8;
      format_name = "RAW8";
      break;
    case ESP_VIDEO_FORMAT_RAW10:
      v4l2_format = V4L2_PIX_FMT_SGRBG10;
      format_name = "RAW10";
      break;
    case ESP_VIDEO_FORMAT_RAW12:
      v4l2_format = V4L2_PIX_FMT_SGRBG12;
      format_name = "RAW12";
      break;
    case ESP_VIDEO_FORMAT_RGB565:
      v4l2_format = V4L2_PIX_FMT_RGB565;
      format_name = "RGB565";
      break;
    case ESP_VIDEO_FORMAT_RGB888:
      v4l2_format = V4L2_PIX_FMT_RGB24;
      format_name = "RGB888";
      break;
    case ESP_VIDEO_FORMAT_YUV420:
      v4l2_format = V4L2_PIX_FMT_YUV420;
      format_name = "YUV420";
      break;
    case ESP_VIDEO_FORMAT_YUV422_YUYV:
      v4l2_format = V4L2_PIX_FMT_YUYV;
      format_name = "YUV422_YUYV";
      break;
    case ESP_VIDEO_FORMAT_YUV422_UYVY:
      v4l2_format = V4L2_PIX_FMT_UYVY;
      format_name = "YUV422_UYVY";
      break;
    case ESP_VIDEO_FORMAT_GRAY8:
      v4l2_format = V4L2_PIX_FMT_GREY;
      format_name = "GRAY8";
      break;
    case ESP_VIDEO_FORMAT_JPEG:
      v4l2_format = V4L2_PIX_FMT_JPEG;
      format_name = "JPEG";
      break;
    default: return false;
  }

  return true;
}

static bool v4l2_format_to_video_format(uint32_t v4l2_format, esp_video_format_t &format_type, std::string &format_name) {
  switch (v4l2_format) {
    case V4L2_PIX_FMT_SRGGB8:
      format_type = ESP_VIDEO_FORMAT_RAW8;
      format_name = "RAW8";
      break;
    case V4L2_PIX_FMT_SGRBG10:
      format_type = ESP_VIDEO_FORMAT_RAW10;
      format_name = "RAW10";
      break;
    case V4L2_PIX_FMT_SGRBG12:
      format_type = ESP_VIDEO_FORMAT_RAW12;
      format_name = "RAW12";
      break;
    case V4L2_PIX_FMT_RGB565:
      format_type = ESP_VIDEO_FORMAT_RGB565;
      format_name = "RGB565";
      break;
    case V4L2_PIX_FMT_RGB24:
      format_type = ESP_VIDEO_FORMAT_RGB888;
      format_name = "RGB888";
      break;
    case V4L2_PIX_FMT_YUV420:
      format_type = ESP_VIDEO_FORMAT_YUV420;
      format_name = "YUV420";
      break;
    case V4L2_PIX_FMT_YUYV:
      format_type = ESP_VIDEO_FORMAT_YUV422_YUYV;
      format_name = "YUV422_YUYV";
      break;
    case V4L2_PIX_FMT_UYVY:
      format_type = ESP_VIDEO_FORMAT_YUV422_UYVY;
      format_name = "YUV422_UYVY";
      break;
    case V4L2_PIX_FMT_GREY:
      format_type = ESP_VIDEO_FORMAT_GRAY8;
      format_name = "GRAY8";
      break;
    case V4L2_PIX_FMT_JPEG:
      format_type = ESP_VIDEO_FORMAT_JPEG;
      format_name = "JPEG";
      break;
    default: return false;
  }

  return true;
}

ESPVideoSolutionClass &ESPVideoSolutionClass::operator=(const ESPVideoSolutionClass &config) {
  if (this != &config) {
    width_ = config.width_;
    height_ = config.height_;
  }
  return *this;
}

void ESPVideoSolutionClass::begin(uint32_t width, uint32_t height) {
  width_ = width;
  height_ = height;
}

uint32_t ESPVideoSolutionClass::getWidth() const {
  return width_;
}

uint32_t ESPVideoSolutionClass::getHeight() const {
  return height_;
}

ESPVideoFormatClass &ESPVideoFormatClass::operator=(const ESPVideoFormatClass &config) {
  if (this != &config) {
    format_type_ = config.format_type_;
    format_name_ = config.format_name_;
  }
  return *this;
}

void ESPVideoFormatClass::begin(esp_video_format_t format_type, const std::string &format_name) {
  format_type_ = format_type;
  format_name_ = format_name;
}

esp_video_format_t ESPVideoFormatClass::getFormat() const {
  return format_type_;
}

const char *ESPVideoFormatClass::getFormatName() const {
  if (format_name_.empty()) {
    uint32_t buf_format = 0;

    if (!video_format_to_v4l2_format(format_type_, buf_format, format_name_)) {
      format_name_ = "UNKNOWN";
    }
  }

  return format_name_.c_str();
}

ESPVideoCamConfigClass::ESPVideoCamConfigClass(const ESPVideoCamConfigClass &config)
  : port(config.port), scl_pin(config.scl_pin), sda_pin(config.sda_pin), i2c_freq(config.i2c_freq), reset_pin(config.reset_pin), pwdn_pin(config.pwdn_pin),
    i2c_handle(config.i2c_handle) {}

ESPVideoCamConfigClass &ESPVideoCamConfigClass::operator=(const ESPVideoCamConfigClass &config) {
  if (this != &config) {
    port = config.port;
    scl_pin = config.scl_pin;
    sda_pin = config.sda_pin;
    i2c_freq = config.i2c_freq;
    reset_pin = config.reset_pin;
    pwdn_pin = config.pwdn_pin;
    i2c_handle = config.i2c_handle;
  }
  return *this;
}

bool ESPVideoCamConfigClass::begin(i2c_port_num_t port, int8_t scl_pin, int8_t sda_pin, uint32_t i2c_freq, int8_t reset_pin, int8_t pwdn_pin) {
  this->port = port;
  this->scl_pin = static_cast<gpio_num_t>(scl_pin);
  this->sda_pin = static_cast<gpio_num_t>(sda_pin);
  this->i2c_freq = i2c_freq;
  this->reset_pin = static_cast<gpio_num_t>(reset_pin);
  this->pwdn_pin = static_cast<gpio_num_t>(pwdn_pin);
  this->i2c_handle = nullptr;
  return true;
}

bool ESPVideoCamConfigClass::begin(i2c_master_bus_handle_t i2c_handle, uint32_t i2c_freq, int8_t reset_pin, int8_t pwdn_pin) {
  this->port = static_cast<i2c_port_num_t>(-1);
  this->scl_pin = GPIO_NUM_NC;
  this->sda_pin = GPIO_NUM_NC;
  this->i2c_freq = i2c_freq;
  this->reset_pin = static_cast<gpio_num_t>(reset_pin);
  this->pwdn_pin = static_cast<gpio_num_t>(pwdn_pin);
  this->i2c_handle = i2c_handle;
  return true;
}

