espressif/arduino-esp32/libraries/ESP_Video/src/ESP_Video.cpp
bool ESPVideoCamConfigClass::needInitI2C() const {
  return i2c_handle == nullptr;
}

bool ESPVideoCamConfigClass::acquirePins() {
  return setPinsBus();
}

bool ESPVideoCamConfigClass::releasePins() {
  return clearPinsBus();
}

bool ESPVideoCamConfigClass::setPinsBus() {
  if (!clearPinsBus()) {
    log_e("failed to clear pins bus");
    return false;
  }

  if (reset_pin != GPIO_NUM_NC) {
    if (!perimanSetPinBus(reset_pin, ESP32_BUS_TYPE_GPIO, (void *)this, -1, -1)) {
      log_e("failed to set reset pin");
      goto cleanup;
    }
  }

  if (pwdn_pin != GPIO_NUM_NC) {
    if (!perimanSetPinBus(pwdn_pin, ESP32_BUS_TYPE_GPIO, (void *)this, -1, -1)) {
      log_e("failed to set pwdn pin");
      goto cleanup;
    }
  }

  if (needInitI2C()) {
    if (!perimanSetPinBus(scl_pin, ESP32_BUS_TYPE_I2C_MASTER_SCL, (void *)(port + 1), port, -1)) {
      log_e("failed to set scl pin");
      goto cleanup;
    }
    if (!perimanSetPinBus(sda_pin, ESP32_BUS_TYPE_I2C_MASTER_SDA, (void *)(port + 1), port, -1)) {
      log_e("failed to set sda pin");
      goto cleanup;
    }
  }

  return true;

cleanup:
  clearPinsBus();
  return false;
}

bool ESPVideoCamConfigClass::clearPinsBus() {
  if (reset_pin != GPIO_NUM_NC) {
    if (!perimanClearPinBus(reset_pin)) {
      log_e("failed to clear reset pin");
      return false;
    }
  }

  if (pwdn_pin != GPIO_NUM_NC) {
    if (!perimanClearPinBus(pwdn_pin)) {
      log_e("failed to clear pwdn pin");
      return false;
    }
  }

  if (needInitI2C()) {
    if (!perimanClearPinBus(scl_pin)) {
      log_e("failed to clear scl pin");
      return false;
    }
    if (!perimanClearPinBus(sda_pin)) {
      log_e("failed to clear sda pin");
      return false;
    }
  }

  return true;
}

esp_video_init_sccb_config_t ESPVideoCamConfigClass::getSccbConfig() const {
  esp_video_init_sccb_config_t config = {};

  if (needInitI2C()) {
    config.init_sccb = true;
    config.i2c_config.port = static_cast<uint8_t>(port);
    config.i2c_config.scl_pin = scl_pin;
    config.i2c_config.sda_pin = sda_pin;
  } else {
    config.init_sccb = false;
    config.i2c_handle = i2c_handle;
  }
  config.freq = i2c_freq;

  return config;
}

#if CONFIG_ESP_VIDEO_ENABLE_MIPI_CSI_VIDEO_DEVICE
ESPVideoCSIConfigClass::ESPVideoCSIConfigClass(const ESPVideoCSIConfigClass &config) : ESPVideoCamConfigClass(config), dont_init_ldo(config.dont_init_ldo) {}

bool ESPVideoCSIConfigClass::begin(const ESPVideoCamConfigClass &config, bool dont_init_ldo) {
  ESPVideoCamConfigClass::operator=(config);
  this->dont_init_ldo = dont_init_ldo;
  return true;
}

esp_video_init_csi_config_t ESPVideoCSIConfigClass::getCsiInitConfig() const {
  esp_video_init_csi_config_t config = {
    .sccb_config = getSccbConfig(),
    .reset_pin = getResetPin(),
    .pwdn_pin = getPwdnPin(),
    .dont_init_ldo = dont_init_ldo,
  };

  return config;
}
#endif  // CONFIG_ESP_VIDEO_ENABLE_MIPI_CSI_VIDEO_DEVICE

#if CONFIG_ESP_VIDEO_ENABLE_DVP_VIDEO_DEVICE
ESPVideoDVPPinsConfigClass::ESPVideoDVPPinsConfigClass(const ESPVideoDVPPinsConfigClass &config) : dvp_pin(config.dvp_pin) {}

bool ESPVideoDVPPinsConfigClass::begin(
  int8_t vsync_pin, int8_t de_pin, int8_t pclk_pin, int8_t xclk_pin, int8_t data0_pin, int8_t data1_pin, int8_t data2_pin, int8_t data3_pin, int8_t data4_pin,
  int8_t data5_pin, int8_t data6_pin, int8_t data7_pin
) {
  dvp_pin.data_width = CAM_CTLR_DATA_WIDTH_8;

  dvp_pin.vsync_io = static_cast<gpio_num_t>(vsync_pin);
  dvp_pin.de_io = static_cast<gpio_num_t>(de_pin);
  dvp_pin.pclk_io = static_cast<gpio_num_t>(pclk_pin);
  dvp_pin.xclk_io = static_cast<gpio_num_t>(xclk_pin);

  dvp_pin.data_io[0] = static_cast<gpio_num_t>(data0_pin);
  dvp_pin.data_io[1] = static_cast<gpio_num_t>(data1_pin);
  dvp_pin.data_io[2] = static_cast<gpio_num_t>(data2_pin);
  dvp_pin.data_io[3] = static_cast<gpio_num_t>(data3_pin);
  dvp_pin.data_io[4] = static_cast<gpio_num_t>(data4_pin);
  dvp_pin.data_io[5] = static_cast<gpio_num_t>(data5_pin);
  dvp_pin.data_io[6] = static_cast<gpio_num_t>(data6_pin);
  dvp_pin.data_io[7] = static_cast<gpio_num_t>(data7_pin);

  return true;
}

ESPVideoDVPPinsConfigClass &ESPVideoDVPPinsConfigClass::operator=(const ESPVideoDVPPinsConfigClass &config) {
  if (this != &config) {
    dvp_pin = config.dvp_pin;
  }
  return *this;
}

bool ESPVideoDVPPinsConfigClass::setPinsBus() {
  if (!clearPinsBus()) {
    log_e("failed to clear pins bus");
    return false;
  }

  if (!perimanSetPinBus(dvp_pin.xclk_io, ESP32_BUS_TYPE_LCDCAM_CAM_XCLK, (void *)(dvp_pin.xclk_io + 1), -1, -1)) {
    log_e("failed to set xclk pin");
    goto cleanup;
  }

  if (!perimanSetPinBus(dvp_pin.vsync_io, ESP32_BUS_TYPE_LCDCAM_CAM_VSYNC, (void *)(dvp_pin.vsync_io + 1), -1, -1)) {
    log_e("failed to set vsync pin");
    goto cleanup;
  }

  if (!perimanSetPinBus(dvp_pin.de_io, ESP32_BUS_TYPE_LCDCAM_CAM_HSYNC, (void *)(dvp_pin.de_io + 1), -1, -1)) {
    log_e("failed to set de pin");
    goto cleanup;
  }

  if (!perimanSetPinBus(dvp_pin.pclk_io, ESP32_BUS_TYPE_LCDCAM_CAM_PCLK, (void *)(dvp_pin.pclk_io + 1), -1, -1)) {
    log_e("failed to set pclk pin");
    goto cleanup;
  }

  for (int i = 0; i < 8; ++i) {
    if (!perimanSetPinBus(dvp_pin.data_io[i], (peripheral_bus_type_t)(ESP32_BUS_TYPE_LCDCAM_CAM_D0 + i), (void *)(dvp_pin.data_io[i] + 1), -1, -1)) {
      log_e("failed to set data pin");
      goto cleanup;
    }
  }

  return true;

cleanup:
  clearPinsBus();
  return false;
}

bool ESPVideoDVPPinsConfigClass::clearPinsBus() {
  if (!perimanClearPinBus(dvp_pin.xclk_io)) {
    log_e("failed to clear xclk pin");
    return false;
  }
  if (!perimanClearPinBus(dvp_pin.vsync_io)) {
    log_e("failed to clear vsync pin");
    return false;
  }
  if (!perimanClearPinBus(dvp_pin.de_io)) {
    log_e("failed to clear de pin");
    return false;
  }
  if (!perimanClearPinBus(dvp_pin.pclk_io)) {
    log_e("failed to clear pclk pin");
    return false;
  }
  for (int i = 0; i < 8; ++i) {
    if (!perimanClearPinBus(dvp_pin.data_io[i])) {
      log_e("failed to clear data pin %d", i);
      return false;
    }
  }

