espressif/arduino-esp32/libraries/ESP_Video/src/ESP_Video.cpp
  return true;
}

ESPVideoDVPConfigClass::ESPVideoDVPConfigClass(const ESPVideoDVPConfigClass &config)
  : ESPVideoCamConfigClass(config), ESPVideoDVPPinsConfigClass(config), xclk_freq(config.xclk_freq) {}

bool ESPVideoDVPConfigClass::begin(const ESPVideoCamConfigClass &config, const ESPVideoDVPPinsConfigClass &dvp_pin, uint32_t xclk_freq) {
  ESPVideoCamConfigClass::operator=(config);
  ESPVideoDVPPinsConfigClass::operator=(dvp_pin);
  this->xclk_freq = xclk_freq;
  return true;
}

ESPVideoDVPConfigClass &ESPVideoDVPConfigClass::operator=(const ESPVideoDVPConfigClass &config) {
  if (this != &config) {
    ESPVideoCamConfigClass::operator=(config);
    ESPVideoDVPPinsConfigClass::operator=(config);
    xclk_freq = config.xclk_freq;
  }
  return *this;
}

esp_video_init_dvp_config_t ESPVideoDVPConfigClass::getDvpInitConfig() const {
  esp_video_init_dvp_config_t config = {
    .sccb_config = getSccbConfig(),
    .reset_pin = getResetPin(),
    .pwdn_pin = getPwdnPin(),
    .dvp_pin = getDvpPin(),
    .xclk_freq = xclk_freq,
  };

  return config;
}

bool ESPVideoDVPConfigClass::acquirePins() {
  return setPinsBus();
}

bool ESPVideoDVPConfigClass::releasePins() {
  return clearPinsBus();
}

bool ESPVideoDVPConfigClass::setPinsBus() {
  if (!ESPVideoCamConfigClass::setPinsBus()) {
    log_e("failed to set camera pins bus");
    return false;
  }

  if (!ESPVideoDVPPinsConfigClass::setPinsBus()) {
    log_e("failed to set pins bus");
    ESPVideoCamConfigClass::clearPinsBus();
    return false;
  }

  return true;
}

bool ESPVideoDVPConfigClass::clearPinsBus() {
  bool ok = ESPVideoDVPPinsConfigClass::clearPinsBus();
  if (!ESPVideoCamConfigClass::clearPinsBus()) {
    log_e("failed to clear camera pins bus");
    ok = false;
  }

  return ok;
}
#endif  // CONFIG_ESP_VIDEO_ENABLE_DVP_VIDEO_DEVICE

ESPVideoBufferClass::ESPVideoBufferClass(
  int fd, uint8_t *ptr, size_t n, int index, uint32_t type, uint32_t memory, const ESPVideoSolutionClass &solution, const ESPVideoFormatClass &format
)
  : ESPVideoSolutionClass(solution), ESPVideoFormatClass(format), buf_fd(fd), buf_ptr(ptr), buf_size(n), buf_index(index), buf_type(type), memory_type(memory) {
}

ESPVideoBufferClass::ESPVideoBufferClass(ESPVideoBufferClass &&other) noexcept
  : ESPVideoSolutionClass(other), ESPVideoFormatClass(other), buf_fd(other.buf_fd), buf_ptr(other.buf_ptr), buf_size(other.buf_size),
    buf_index(other.buf_index), buf_type(other.buf_type), memory_type(other.memory_type) {
  other.buf_fd = -1;
  other.buf_ptr = nullptr;
  other.buf_size = 0;
  other.buf_index = -1;
}

ESPVideoBufferClass &ESPVideoBufferClass::operator=(ESPVideoBufferClass &&other) noexcept {
  if (this != &other) {
    end();

    ESPVideoSolutionClass::operator=(other);
    ESPVideoFormatClass::operator=(other);

    buf_fd = other.buf_fd;
    buf_ptr = other.buf_ptr;
    buf_size = other.buf_size;
    buf_index = other.buf_index;
    buf_type = other.buf_type;
    memory_type = other.memory_type;

    other.buf_fd = -1;
    other.buf_ptr = nullptr;
    other.buf_size = 0;
    other.buf_index = -1;
  }
  return *this;
}

ESPVideoBufferClass::~ESPVideoBufferClass() {
  end();
}

void ESPVideoBufferClass::end() {
  reclaim();
}

bool ESPVideoBufferClass::valid() const {
  return buf_ptr != nullptr && buf_size > 0;
}

uint8_t *ESPVideoBufferClass::data() const {
  return buf_ptr;
}

size_t ESPVideoBufferClass::size() const {
  return buf_size;
}

int ESPVideoBufferClass::index() const {
  return buf_index;
}

const char *ESPVideoBufferClass::formatName() const {
  return getFormatName();
}

esp_video_format_t ESPVideoBufferClass::formatType() const {
  return getFormat();
}

void ESPVideoBufferClass::reclaim() {
  if (buf_fd >= 0 && buf_index >= 0) {
    struct v4l2_buffer buf = {};

    buf.type = buf_type;
    buf.memory = memory_type;
    buf.index = buf_index;
    if (ioctl(buf_fd, VIDIOC_QBUF, &buf) != 0) {
      log_e("failed to queue video frame");
    }

    buf_fd = -1;
    buf_index = -1;
  }
}

ESPVideoCaptureDevClass::~ESPVideoCaptureDevClass() {
  end();
}

bool ESPVideoCaptureDevClass::begin(const char *path, size_t buf_count) {
  if (isOpened()) {
    return true;
  }

  if (!open(path)) {
    return false;
  }

  if (!requestBuffer(buf_count)) {
    end();
    return false;
  }

  buf_count_ = buf_count;

  return true;
}

void ESPVideoCaptureDevClass::end() {
  stopCapture();
  releaseBuffers();

  if (fd >= 0) {
    close(fd);
    fd = -1;
  }
}

bool ESPVideoCaptureDevClass::open(const char *path) {
  if (fd >= 0) {
    return true;
  }

  fd = ::open(path, O_RDWR);
  if (fd < 0) {
    log_e("failed to open %s", path);
    return false;
  }

  if (!applyFormat()) {
    close(fd);
    fd = -1;
    return false;
  }

  return true;
}

bool ESPVideoCaptureDevClass::applyFormat() {
  if (fd < 0) {
    return false;
  }

  struct v4l2_format format = {};
  format.type = V4L2_BUF_TYPE_VIDEO_CAPTURE;
  if (ioctl(fd, VIDIOC_G_FMT, &format) != 0) {
    log_e("failed to get format");
    return false;
  }

  esp_video_format_t format_type = ESP_VIDEO_FORMAT_UNKNOWN;
  std::string format_name;

  if (!v4l2_format_to_video_format(format.fmt.pix.pixelformat, format_type, format_name)) {
    ESPVideoFormatClass::begin(ESP_VIDEO_FORMAT_UNKNOWN, "UNKNOWN");
  } else {
    ESPVideoFormatClass::begin(format_type, format_name);
  }

  if (ioctl(fd, VIDIOC_S_FMT, &format) != 0) {
    log_e("failed to set format");
    return false;
  }

  ESPVideoSolutionClass::begin(format.fmt.pix.width, format.fmt.pix.height);

  return true;
}

void ESPVideoCaptureDevClass::releaseBuffers() {
  for (size_t i = 0; i < buf_ptr_.size(); ++i) {
    if (buf_ptr_[i] != nullptr && buf_ptr_[i] != MAP_FAILED) {
      munmap(buf_ptr_[i], buf_len_[i]);
    }
  }
  buf_ptr_.clear();
  buf_len_.clear();

  if (fd >= 0) {
    struct v4l2_requestbuffers req = {};
    req.count = 0;
    req.type = buffer_type_;
    req.memory = memory_type_;
    ioctl(fd, VIDIOC_REQBUFS, &req);
  }
}

bool ESPVideoCaptureDevClass::requestBuffer(size_t buf_count) {
  if (fd < 0) {
    return false;
  }

  releaseBuffers();

  struct v4l2_requestbuffers req = {};
  memory_type_ = V4L2_MEMORY_MMAP;
  req.count = buf_count;
  req.type = buffer_type_;
  req.memory = memory_type_;
  if (ioctl(fd, VIDIOC_REQBUFS, &req) != 0) {
    log_e("failed to require buffer");
    return false;
  }

