espressif/arduino-esp32/libraries/ESP_Video/src/ESP_Video.cpp
  buf_ptr_.reserve(buf_count);
  buf_len_.reserve(buf_count);

  for (size_t i = 0; i < buf_count; ++i) {
    struct v4l2_buffer buf = {};
    buf.type = buffer_type_;
    buf.memory = memory_type_;
    buf.index = static_cast<uint32_t>(i);
    if (ioctl(fd, VIDIOC_QUERYBUF, &buf) != 0) {
      log_e("failed to query buffer");
      releaseBuffers();
      return false;
    }

    uint8_t *ptr = static_cast<uint8_t *>(mmap(nullptr, buf.length, PROT_READ | PROT_WRITE, MAP_SHARED, fd, buf.m.offset));
    if (ptr == MAP_FAILED) {
      log_e("failed to map buffer");
      releaseBuffers();
      return false;
    }

    buf_ptr_.push_back(ptr);
    buf_len_.push_back(buf.length);
  }

  return true;
}

bool ESPVideoCaptureDevClass::startCapture() {
  if (!isOpened()) {
    return false;
  }

  if (buf_ptr_.empty()) {
    log_e("no buffer is setup");
    return false;
  }

  for (size_t i = 0; i < buf_ptr_.size(); ++i) {
    struct v4l2_buffer buf = {};
    buf.type = buffer_type_;
    buf.memory = memory_type_;
    buf.index = static_cast<uint32_t>(i);
    if (ioctl(fd, VIDIOC_QBUF, &buf) != 0) {
      log_e("failed to queue video frame");
      return false;
    }
  }

  int type = buffer_type_;
  if (ioctl(fd, VIDIOC_STREAMON, &type) != 0) {
    log_e("failed to start stream");
    return false;
  }

  capture_started_ = true;
  return true;
}

void ESPVideoCaptureDevClass::stopCapture() {
  if (!capture_started_ || fd < 0) {
    return;
  }

  int type = buffer_type_;
  if (ioctl(fd, VIDIOC_STREAMOFF, &type) != 0) {
    log_e("failed to stop stream");
  }
  capture_started_ = false;
}

ESPVideoBufferClass ESPVideoCaptureDevClass::captureBuffer() {
  if (!capture_started_ || fd < 0) {
    return ESPVideoBufferClass();
  }

  struct v4l2_buffer buf = {};
  buf.type = buffer_type_;
  buf.memory = memory_type_;
  if (ioctl(fd, VIDIOC_DQBUF, &buf) != 0) {
    log_e("failed to receive video frame");
    return ESPVideoBufferClass();
  }

  if (buf.index >= buf_ptr_.size()) {
    log_e("invalid buffer index %u", buf.index);
    return ESPVideoBufferClass();
  }

  return ESPVideoBufferClass(fd, buf_ptr_[buf.index], buf.bytesused, static_cast<int>(buf.index), buffer_type_, memory_type_, *this, *this);
}

bool ESPVideoCaptureDevClass::isOpened() const {
  return fd >= 0;
}

bool ESPVideoCaptureDevClass::isCaptureStarted() const {
  return capture_started_;
}

bool ESPVideoCaptureDevClass::setFormat(esp_video_format_t format) {
  if (fd < 0) {
    return false;
  }

  uint32_t video_format = 0;
  std::string format_name;

  if (!video_format_to_v4l2_format(format, video_format, format_name)) {
    return false;
  }

  struct v4l2_format v4l2_format = {};
  v4l2_format.type = V4L2_BUF_TYPE_VIDEO_CAPTURE;
  if (ioctl(fd, VIDIOC_G_FMT, &v4l2_format) != 0) {
    log_e("failed to get format");
    return false;
  }

  if (v4l2_format.fmt.pix.pixelformat != video_format) {
    v4l2_format.fmt.pix.pixelformat = video_format;
    if (ioctl(fd, VIDIOC_S_FMT, &v4l2_format) != 0) {
      log_e("failed to set format");
      return false;
    }

    if (buf_count_ > 0) {
      if (!requestBuffer(buf_count_)) {
        log_e("failed to request buffer");
        releaseBuffers();
        return false;
      }
    }
  }

  ESPVideoFormatClass::begin(format, format_name);

  return true;
}

bool ESPVideoCaptureDevClass::setSensorGain(int32_t gain) {
  return setExtCtrlValue(V4L2_CID_GAIN, gain);
}

bool ESPVideoCaptureDevClass::setSensorExposure(int32_t exposure) {
  return setExtCtrlValue(V4L2_CID_EXPOSURE, exposure);
}

bool ESPVideoCaptureDevClass::setSensorExposureTime(int32_t exposure_time) {
  return setExtCtrlValue(V4L2_CID_EXPOSURE_ABSOLUTE, exposure_time);
}

bool ESPVideoCaptureDevClass::setSensorAETargetLevel(int32_t target_level) {
  return setExtCtrlValue(V4L2_CID_CAMERA_AE_LEVEL, target_level);
}

bool ESPVideoCaptureDevClass::setSensorJPEGQuality(int32_t quality) {
  return setExtCtrlValue(V4L2_CID_JPEG_COMPRESSION_QUALITY, quality);
}

bool ESPVideoCaptureDevClass::setSensorVFlip(bool vflip) {
  return setExtCtrlValue(V4L2_CID_VFLIP, vflip);
}

bool ESPVideoCaptureDevClass::setSensorHFlip(bool hflip) {
  return setExtCtrlValue(V4L2_CID_HFLIP, hflip);
}

bool ESPVideoCaptureDevClass::setSensorTestPattern(bool test_pattern) {
  return setExtCtrlValue(V4L2_CID_TEST_PATTERN, test_pattern);
}

bool ESPVideoCaptureDevClass::setExtCtrlValue(uint32_t id, int32_t value) {
  if (fd < 0) {
    return false;
  }

  struct v4l2_ext_control control = {};
  struct v4l2_ext_controls controls = {};

  controls.count = 1;
  controls.controls = &control;
  control.id = id;
  control.value = value;

  return ioctl(fd, VIDIOC_S_EXT_CTRLS, &controls) == 0;
}

ESPVideoClass::~ESPVideoClass() {
  end();
}

void ESPVideoClass::end() {
  if (flags_ != 0) {
#if CONFIG_ESP_VIDEO_ENABLE_MIPI_CSI_VIDEO_DEVICE
    if (flags_ & ESP_VIDEO_INIT_FLAGS_MIPI_CSI && csi_config_) {
      csi_config_->releasePins();
    }
#endif
#if CONFIG_ESP_VIDEO_ENABLE_DVP_VIDEO_DEVICE
    if (flags_ & ESP_VIDEO_INIT_FLAGS_DVP && dvp_config_) {
      dvp_config_->releasePins();
    }
#endif

    esp_video_deinit_with_flags(flags_);
    flags_ = 0;
  }

#if CONFIG_ESP_VIDEO_ENABLE_MIPI_CSI_VIDEO_DEVICE
  csi_config_.reset();
#endif
#if CONFIG_ESP_VIDEO_ENABLE_DVP_VIDEO_DEVICE
  dvp_config_.reset();
#endif
}

#if CONFIG_ESP_VIDEO_ENABLE_MIPI_CSI_VIDEO_DEVICE
bool ESPVideoClass::begin(const ESPVideoCSIConfigClass &config) {
  constexpr uint32_t target_flags = ESP_VIDEO_INIT_FLAGS_MIPI_CSI | ESP_VIDEO_INIT_FLAGS_ISP;
  if ((flags_ & target_flags) == target_flags) {
    return true;
  }

  esp_video_init_csi_config_t csi_config = config.getCsiInitConfig();
  esp_video_init_config_t cam_config = {};
  cam_config.csi = &csi_config;

  csi_config_ = std::make_unique<ESPVideoCSIConfigClass>(config);
  if (!csi_config_->acquirePins()) {
    log_e("failed to acquire pins");
    csi_config_->releasePins();
    csi_config_.reset();
    return false;
  }

  if (esp_video_init_with_flags(&cam_config, target_flags) != ESP_OK) {
    log_e("failed to init CSI");
    csi_config_->releasePins();
    csi_config_.reset();
    return false;
  }

  flags_ |= target_flags;
  return true;
}

bool ESPVideoClass::isCSIInitialized() const {
  constexpr uint32_t target_flags = ESP_VIDEO_INIT_FLAGS_MIPI_CSI | ESP_VIDEO_INIT_FLAGS_ISP;
  return (flags_ & target_flags) == target_flags;
}
#endif  // CONFIG_ESP_VIDEO_ENABLE_MIPI_CSI_VIDEO_DEVICE

#if CONFIG_ESP_VIDEO_ENABLE_DVP_VIDEO_DEVICE
bool ESPVideoClass::begin(const ESPVideoDVPConfigClass &config) {
  constexpr uint32_t target_flags = ESP_VIDEO_INIT_FLAGS_DVP;
  if ((flags_ & target_flags) == target_flags) {
    return true;
  }

  esp_video_init_dvp_config_t dvp_config = config.getDvpInitConfig();
  esp_video_init_config_t cam_config = {};
  cam_config.dvp = &dvp_config;

  dvp_config_ = std::make_unique<ESPVideoDVPConfigClass>(config);
  if (!dvp_config_->acquirePins()) {
    log_e("failed to acquire pins");
    dvp_config_->releasePins();
    dvp_config_.reset();
    return false;
  }

  if (esp_video_init_with_flags(&cam_config, target_flags) != ESP_OK) {
    log_e("failed to init DVP");
    dvp_config_->releasePins();
    dvp_config_.reset();
    return false;
  }

  flags_ |= target_flags;
  return true;
}

bool ESPVideoClass::isDVPInitialized() const {
  constexpr uint32_t target_flags = ESP_VIDEO_INIT_FLAGS_DVP;
  return (flags_ & target_flags) == target_flags;
}
#endif  // CONFIG_ESP_VIDEO_ENABLE_DVP_VIDEO_DEVICE

#endif  // ESP_IDF_VERSION >= ESP_IDF_VERSION_VAL(5, 4, 0)
#endif  // CONFIG_ESP_VIDEO_ENABLE_MIPI_CSI_VIDEO_DEVICE || CONFIG_ESP_VIDEO_ENABLE_DVP_VIDEO_DEVICE
